Mininet-client-farm
===================

Generate and configure mininet client Farm.
The idea is to use mininet VM box to emulate hosts that interact with GNS3 virtualized infrastructure. These emulated hosts use far less resources than separated fully virtualized machines and far more capable than VPCS.
In the lab below, I used mininet Vbox VM to emulated 50 client machines connected to Internet through GNS3 topology, which can be as complex as it can virtualize).

![Alt text](https://community.gns3.com/servlet/JiveServlet/downloadImage/102-2022-7-35071/2014-12-18+16+18+11.png)

Here some great resources to begin with if you want to have fun with mininet:
http://mininet.org/
https://github.com/mininet/mininet/wiki/Introduction-to-Mininet
https://github.com/mininet/mininet/tree/master/examples

You can install mininet on any linux VM and use it inside GNS3, or download a ready mininet VM here:
http://mininet.org/download/

![Alt text](https://community.gns3.com/servlet/JiveServlet/downloadImage/102-2022-7-35073/Selection_242.png)

Lauch the script:

![Alt text](https://community.gns3.com/servlet/JiveServlet/downloadImage/102-2022-7-35074/pastedImage_0.png)

Mininet hosts (host h1 for example) should get DHCP inf. from Cisco router inside GNS3.

Let's check it:

    mininet> h1 ip a   
    RTNETLINK answers: File exists   
    1: lo: <LOOPBACK,UP,LOWER_UP> mtu 65536 qdisc noqueue state UNKNOWN   
      link/loopback 00:00:00:00:00:00 brd 00:00:00:00:00:00   
      inet 127.0.0.1/8 scope host lo   
      valid_lft forever preferred_lft forever   
      inet6 ::1/128 scope host   
      valid_lft forever preferred_lft forever   
    5: h1-eth0: <BROADCAST,MULTICAST,UP,LOWER_UP> mtu 1500 qdisc pfifo_fast state UP qlen 1000   
      link/ether b6:75:37:a1:e5:fa brd ff:ff:ff:ff:ff:ff   
      inet 10.0.0.1/8 brd 10.255.255.255 scope global h1-eth0   
      valid_lft forever preferred_lft forever   
      inet6 fe80::b475:37ff:fea1:e5fa/64 scope link   
      valid_lft forever preferred_lft forever   
    mininet>  

DHCP inf. received:

    mininet> h1 cat /etc/resolv.conf   
    # Dynamic resolv.conf(5) file for glibc resolver(3) generated by resolvconf(8)   
    # DO NOT EDIT THIS FILE BY HAND -- YOUR CHANGES WILL BE OVERWRITTEN   
    nameserver 192.168.0.254   
    nameserver 8.8.8.8   
    search cciethebeginning.wordpress.com   
    mininet>   

 

Connectivity to the outside world from within mininet host and though GNS3 topology:

    mininet> h1 ping www.gns3.com   
    PING www.gns3.com (104.28.20.109) 56(84) bytes of data.   
    64 bytes from 104.28.20.109: icmp_req=1 ttl=52 time=35.1 ms   
    64 bytes from 104.28.20.109: icmp_req=2 ttl=52 time=30.0 ms   
    64 bytes from 104.28.20.109: icmp_req=3 ttl=52 time=26.5 ms   
    64 bytes from 104.28.20.109: icmp_req=4 ttl=52 time=26.0 ms   
    ^C   
    --- www.gns3.com ping statistics ---   
    4 packets transmitted, 4 received, 0% packet loss, time 3005ms   
    rtt min/avg/max/mdev = 26.010/29.449/35.129/3.629 ms   
    mininet>   

 

Example using nslookup:

    mininet> h1 nslookup gns3.com   
    Server: 192.168.0.254   
    Address: 192.168.0.254#53   
      
    Non-authoritative answer:   
    Name: gns3.com   
    Address: 104.28.20.109   
    Name: gns3.com   
    Address: 104.28.21.109   
      
    mininet>   


Example using dig:

    mininet> h1 dig gns3.com   
      
    ; <<>> DiG 9.8.1-P1 <<>> gns3.com   
    ;; global options: +cmd   
    ;; Got answer:   
    ;; ->>HEADER<<- opcode: QUERY, status: NOERROR, id: 36538   
    ;; flags: qr rd ra; QUERY: 1, ANSWER: 2, AUTHORITY: 0, ADDITIONAL: 0   
      
    ;; QUESTION SECTION:   
    ;gns3.com. IN A   
      
    ;; ANSWER SECTION:   
    gns3.com. 1775 IN A 104.28.20.109   
    gns3.com. 1775 IN A 104.28.21.109   
      
    ;; Query time: 12 msec   
    ;; SERVER: 192.168.0.254#53(192.168.0.254)   
    ;; WHEN: Thu Dec 18 05:44:15 2014   
    ;; MSG SIZE rcvd: 58   
      
    mininet>   


Execute any script from within each isolated host :

    mininet> h1 python script.py   
    Let's Python power inside each mininet host!!!   
    mininet>   

 

or simply any linux command:

    mininet> h1 time curl -I www.gns3.com | grep HTTP   
      % Total % Received % Xferd Average Speed Time Time Time Current   
     Dload Upload Total Spent Left Speed   
      0 0 0 0 0 0 0 0 --:--:-- --:--:-- --:--:-- 0   
    HTTP/1.1 200 OK   
      
    real 0m0.673s   
    user 0m0.016s   
    sys 0m0.048s   
    mininet>  
